mixly/SMeshStudio/mcore/hw/mbed/boards.txt
###################################################################################################################
mbed_arch_pro_lpc1768_gcc_arm.name=Seeed Arch Pro mbed LPC1768 make by gcc_arm and upload by copy 
mbed_arch_pro_lpc1768_gcc_arm.upload.protocol=copy
mbed_arch_pro_lpc1768_gcc_arm.upload.tool=mbed_cp
mbed_arch_pro_lpc1768_gcc_arm.build.mcu=cortex-m3
mbed_arch_pro_lpc1768_gcc_arm.build.cpu=LPC1768

mbed_arch_pro_lpc1768_gcc_arm.build.architecture=arm-none-eabi
mbed_arch_pro_lpc1768_gcc_arm.build.command.as=arm-none-eabi-as
mbed_arch_pro_lpc1768_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_arch_pro_lpc1768_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_arch_pro_lpc1768_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_arch_pro_lpc1768_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_arch_pro_lpc1768_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_arch_pro_lpc1768_gcc_arm.build.command.size=arm-none-eabi-size

mbed_arch_pro_lpc1768_gcc_arm.build.core=mbed
mbed_arch_pro_lpc1768_gcc_arm.build.variant=mbed_arch_pro_lpc1768_gcc_arm

mbed_arch_pro_lpc1768_gcc_arm.build.CC_FLAGS= -mcpu=cortex-m3 -mthumb -c -Os -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -Wno-unused-function -Wno-unused-variable 
mbed_arch_pro_lpc1768_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_arch_pro_lpc1768_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98
mbed_arch_pro_lpc1768_gcc_arm.build.CC_SYMBOLS = -DTARGET_LPC1768 -DTARGET_M3 -DTARGET_NXP -DTARGET_LPC176X -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M3 -DARM_MATH_CM3  
 
mbed_arch_pro_lpc1768_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m3 -mthumb -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float
mbed_arch_pro_lpc1768_gcc_arm.build.LD_SYS_LIBS =  -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

mbed_arch_pro_lpc1768_gcc_arm.build.ldscript=hw/mbed/variants/mbed_arch_pro_lpc1768_gcc_arm/cmsis/TARGET_NXP/TARGET_LPC176X/TOOLCHAIN_GCC_ARM/LPC1768.ld

mbed_arch_pro_lpc1768_gcc_arm.build.use_archiver=false
mbed_arch_pro_lpc1768_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_arch_pro_lpc1768_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_arch_pro_lpc1768_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_arch_pro_lpc1768_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_arch_pro_lpc1768_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_arch_pro_lpc1768_gcc_arm/cmsis/TARGET_NXP/TARGET_LPC176X/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_arch_pro_lpc1768_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_arch_pro_lpc1768_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_arch_pro_lpc1768_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"

###################################################################################################################
mbed_f103rb_gcc_arm.name=ST Nucleo F103RB mbed boards  by gcc_arm and upload by copy
mbed_f103rb_gcc_arm.upload.protocol=copy
mbed_f103rb_gcc_arm.upload.tool=mbed_cp
mbed_f103rb_gcc_arm.build.mcu=cortex-m3
mbed_f103rb_gcc_arm.build.cpu=STM32F103RBT6

mbed_f103rb_gcc_arm.build.architecture=arm-none-eabi
mbed_f103rb_gcc_arm.build.command.as=arm-none-eabi-as
mbed_f103rb_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_f103rb_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_f103rb_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_f103rb_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_f103rb_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_f103rb_gcc_arm.build.command.size=arm-none-eabi-size

mbed_f103rb_gcc_arm.build.core=mbed
mbed_f103rb_gcc_arm.build.variant=mbed_f103rb_gcc_arm

mbed_f103rb_gcc_arm.build.CC_FLAGS= -mcpu=cortex-m3 -mthumb -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -fno-rtti  -DNDEBUG -Os
mbed_f103rb_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_f103rb_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98
mbed_f103rb_gcc_arm.build.CC_SYMBOLS =  -DTARGET_NUCLEO_F103RB -DTARGET_M3 -DTARGET_CORTEX_M -DTARGET_STM -DTARGET_STM32F1 -DTARGET_STM32F103RB -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M3 -DARM_MATH_CM3 -DMBED_BUILD_TIMESTAMP=1423023642.31 -D__MBED__=1 -DTARGET_FF_ARDUINO -DTARGET_FF_MORPHO 
mbed_f103rb_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m3 -mthumb -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,--wrap,main  -Wl,-Map={build.project_name}.map,--cref
mbed_f103rb_gcc_arm.build.LD_SYS_LIBS =  -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

mbed_f103rb_gcc_arm.build.ldscript=hw/mbed/variants/mbed_f103rb_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F1/TARGET_NUCLEO_F103RB/TOOLCHAIN_GCC_ARM/STM32F103XB.ld

mbed_f103rb_gcc_arm.build.use_archiver=false
mbed_f103rb_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f103rb_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f103rb_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_f103rb_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_f103rb_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/xbed1.0_stm32f103_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F1/TARGET_NUCLEO_F103RB/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_f103rb_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_f103rb_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_f103rb_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"

