mixly/SMeshStudio/mcore/hw/mbed/boards.txt
###################################################################################################################
mbed_l152re_gcc_arm.name=  ST Nucleo L152RE mbed boards  by gcc_arm and upload by copy
mbed_l152re_gcc_arm.upload.protocol=copy
mbed_l152re_gcc_arm.upload.tool=mbed_cp
mbed_l152re_gcc_arm.build.mcu=cortex-m3
mbed_l152re_gcc_arm.build.cpu=STM32L152RET6 

mbed_l152re_gcc_arm.build.architecture=arm-none-eabi
mbed_l152re_gcc_arm.build.command.as=arm-none-eabi-as
mbed_l152re_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_l152re_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_l152re_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_l152re_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_l152re_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_l152re_gcc_arm.build.command.size=arm-none-eabi-size

mbed_l152re_gcc_arm.build.core=mbed
mbed_l152re_gcc_arm.build.variant=mbed_l152re_gcc_arm

mbed_l152re_gcc_arm.build.CC_FLAGS=  -mcpu=cortex-m3 -mthumb  -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -fno-rtti -MMD -MP  -DNDEBUG -Os
mbed_l152re_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_l152re_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_l152re_gcc_arm.build.CC_SYMBOLS = -DTARGET_NUCLEO_L152RE -DTARGET_M3 -DTARGET_CORTEX_M -DTARGET_STM -DTARGET_STM32L1 -DTARGET_STM32L152RE -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M3 -DARM_MATH_CM3 -DMBED_BUILD_TIMESTAMP=1423019984.86 -D__MBED__=1 -DTARGET_FF_ARDUINO -DTARGET_FF_MORPHO   
mbed_l152re_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m3 -mthumb -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,--wrap,main -Wl,-Map={build.project_name}.map,--cref
mbed_l152re_gcc_arm.build.LD_SYS_LIBS =   -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
mbed_l152re_gcc_arm.build.ldscript=hw/mbed/variants/mbed_l152re_gcc_arm/cmsis/TARGET_STM/TARGET_STM32L1/TARGET_NUCLEO_L152RE/TOOLCHAIN_GCC_ARM/STM32L152XE.ld

mbed_l152re_gcc_arm.build.use_archiver=false
mbed_l152re_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_l152re_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_l152re_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_l152re_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_l152re_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_l152re_gcc_arm/cmsis/TARGET_STM/TARGET_STM32L1/TARGET_NUCLEO_L152RE/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_l152re_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_l152re_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_l152re_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"

###################################################################################################################
mbed_l053r8_gcc_arm.name=  ST Nucleo L053R8 mbed boards  by gcc_arm and upload by copy
mbed_l053r8_gcc_arm.upload.protocol=copy
mbed_l053r8_gcc_arm.upload.tool=mbed_cp
mbed_l053r8_gcc_arm.build.mcu=cortex-m0plus
mbed_l053r8_gcc_arm.build.cpu=STM32L053R8T6  

mbed_l053r8_gcc_arm.build.architecture=arm-none-eabi
mbed_l053r8_gcc_arm.build.command.as=arm-none-eabi-as
mbed_l053r8_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_l053r8_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_l053r8_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_l053r8_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_l053r8_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_l053r8_gcc_arm.build.command.size=arm-none-eabi-size

mbed_l053r8_gcc_arm.build.core=mbed
mbed_l053r8_gcc_arm.build.variant=mbed_l053r8_gcc_arm

mbed_l053r8_gcc_arm.build.CC_FLAGS=  -mcpu=cortex-m0plus -mthumb  -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer -MMD -MP -DNDEBUG -Os
mbed_l053r8_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_l053r8_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_l053r8_gcc_arm.build.CC_SYMBOLS =  -DTARGET_NUCLEO_L053R8 -DTARGET_M0P -DTARGET_CORTEX_M -DTARGET_STM -DTARGET_STM32L0 -DTARGET_STM32L053R8 -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M0PLUS -DARM_MATH_CM0PLUS -DMBED_BUILD_TIMESTAMP=1423023193.21 -D__MBED__=1 -DTARGET_FF_ARDUINO -DTARGET_FF_MORPHO 
mbed_l053r8_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m0plus -mthumb -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,--wrap,main -Wl,-Map={build.project_name}.map,--cref
mbed_l053r8_gcc_arm.build.LD_SYS_LIBS = -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
mbed_l053r8_gcc_arm.build.ldscript=hw/mbed/variants/mbed_l053r8_gcc_arm/cmsis/TARGET_STM/TARGET_STM32L0/TARGET_NUCLEO_L053R8/TOOLCHAIN_GCC_ARM/STM32L053X8.ld

mbed_l053r8_gcc_arm.build.use_archiver=false
mbed_l053r8_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_l053r8_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_l053r8_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_l053r8_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_l053r8_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_l053r8_gcc_arm/cmsis/TARGET_STM/TARGET_STM32L0/TARGET_NUCLEO_L053R8/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_l053r8_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_l053r8_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_l053r8_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"

