mixly/SMeshStudio/mcore/hw/mbed/boards.txt
###################################################################################################################
mbed_f030r8_gcc_arm.name=ST Nucleo F030R8 mbed boards  by gcc_arm and upload by copy
mbed_f030r8_gcc_arm.upload.protocol=copy
mbed_f030r8_gcc_arm.upload.tool=mbed_cp
mbed_f030r8_gcc_arm.build.mcu=cortex-m0
mbed_f030r8_gcc_arm.build.cpu=STM32F030R8T6   

mbed_f030r8_gcc_arm.build.architecture=arm-none-eabi
mbed_f030r8_gcc_arm.build.command.as=arm-none-eabi-as
mbed_f030r8_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_f030r8_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_f030r8_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_f030r8_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_f030r8_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_f030r8_gcc_arm.build.command.size=arm-none-eabi-size

mbed_f030r8_gcc_arm.build.core=mbed
mbed_f030r8_gcc_arm.build.variant=mbed_f030r8_gcc_arm

mbed_f030r8_gcc_arm.build.CC_FLAGS=  -mcpu=cortex-m0 -mthumb  -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -MMD -MP -DNDEBUG -Os
mbed_f030r8_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_f030r8_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_f030r8_gcc_arm.build.CC_SYMBOLS =  -DTARGET_NUCLEO_F030R8 -DTARGET_M0 -DTARGET_CORTEX_M -DTARGET_STM -DTARGET_STM32F0 -DTARGET_STM32F030R8 -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M0 -DARM_MATH_CM0 -DMBED_BUILD_TIMESTAMP=1423023986.89 -D__MBED__=1 -DTARGET_FF_ARDUINO -DTARGET_FF_MORPHO  
mbed_f030r8_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m0 -mthumb -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,--wrap,main -Wl,-Map={build.project_name}.map,--cref
mbed_f030r8_gcc_arm.build.LD_SYS_LIBS = -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
mbed_f030r8_gcc_arm.build.ldscript=hw/mbed/variants/mbed_f030r8_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F0/TARGET_NUCLEO_F030R8/TOOLCHAIN_GCC_ARM/STM32F030X8.ld

mbed_f030r8_gcc_arm.build.use_archiver=false
mbed_f030r8_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f030r8_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f030r8_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_f030r8_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_f030r8_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_f030r8_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F0/TARGET_NUCLEO_F030R8/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_f030r8_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_f030r8_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_f030r8_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_f070rb_gcc_arm.name=ST Nucleo F070RB mbed boards  by gcc_arm and upload by copy
mbed_f070rb_gcc_arm.upload.protocol=copy
mbed_f070rb_gcc_arm.upload.tool=mbed_cp
mbed_f070rb_gcc_arm.build.mcu=cortex-m0
mbed_f070rb_gcc_arm.build.cpu=STM32f070rbT6    

mbed_f070rb_gcc_arm.build.architecture=arm-none-eabi
mbed_f070rb_gcc_arm.build.command.as=arm-none-eabi-as
mbed_f070rb_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_f070rb_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_f070rb_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_f070rb_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_f070rb_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_f070rb_gcc_arm.build.command.size=arm-none-eabi-size

mbed_f070rb_gcc_arm.build.core=mbed
mbed_f070rb_gcc_arm.build.variant=mbed_f070rb_gcc_arm

mbed_f070rb_gcc_arm.build.CC_FLAGS=  -mcpu=cortex-m0 -mthumb  -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -MMD -MP -DNDEBUG -Os
mbed_f070rb_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_f070rb_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_f070rb_gcc_arm.build.CC_SYMBOLS =-DTARGET_NUCLEO_F070RB -DTARGET_M0 -DTARGET_CORTEX_M -DTARGET_STM -DTARGET_STM32F0 -DTARGET_STM32F070RB -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M0 -DARM_MATH_CM0 -DMBED_BUILD_TIMESTAMP=1425435388.08 -D__MBED__=1 -DTARGET_FF_ARDUINO -DTARGET_FF_MORPHO 
mbed_f070rb_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m0 -mthumb -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,--wrap,main -Wl,-Map={build.project_name}.map,--cref
mbed_f070rb_gcc_arm.build.LD_SYS_LIBS = -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
mbed_f070rb_gcc_arm.build.ldscript=hw/mbed/variants/mbed_f070rb_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F0/TARGET_NUCLEO_F070RB/TOOLCHAIN_GCC_ARM/STM32F070XB.ld

mbed_f070rb_gcc_arm.build.use_archiver=false
mbed_f070rb_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f070rb_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f070rb_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_f070rb_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_f070rb_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hw/mbed/variants/mbed_f070rb_gcc_arm/cmsis/TARGET_STM/TARGET_STM32F0/TARGET_NUCLEO_F070RB/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_f070rb_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_f070rb_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_f070rb_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"

